high_result_ru = """
Оценка 13-18: 
Продвинутые знания - Поздравляем! У вас есть четкое представление о ВИЧ, его передаче, профилактике, лечении и поддержке. Вы хорошо осведомлены в этой теме.
"""

medium_result_ru = """
Оценка 7–12:
Промежуточные знания — у вас хорошие знания о ВИЧ, но в вашем понимании есть некоторые пробелы. Продолжайте учиться и быть в курсе последней информации о ВИЧ.
"""

small_result_ru = """
Оценка 0–6:
Базовые знания — у вас есть базовые знания о ВИЧ, но есть возможности для совершенствования. Подумайте о том, чтобы узнать больше о передаче ВИЧ, профилактике, лечении и поддержке людей, живущих с ВИЧ.
"""

high_result_kz = """

"""

medium_result_kz = """

"""

small_result_kz = """

"""

question_1_wrong_answer_ru = """
ВИЧ в основном передается при половом контакте (вагинальном или анальном) с инфицированным человеком. 
Он также может передаваться через общие иглы или шприцы, с ВИЧ-инфицированной кровью. 
Кроме того, передача инфекции от матери к ребенку может произойти во время родов или при грудном вскармливании, если мать ВИЧ-положительна. 
Важно отметить, что случайный контакт или передача через инфицированную пищу и воду не являются способами передачи ВИЧ.
"""

question_2_wrong_answer_ru = """
Совместное использование игл с другими людьми представляет собой поведение с высокой степенью риска, которое может привести к передаче ВИЧ. 
Таким образом, совместное использование игл не является методом предотвращения передачи ВИЧ. 
С другой стороны, как (а) постоянное и правильное использование презервативов, так и (б) 
воздержание от половой жизни являются эффективными методами предотвращения передачи ВИЧ. 
Постоянное и правильное использование презервативов может значительно снизить риск передачи ВИЧ при половом акте, 
а воздержание от половой жизни полностью исключает риск передачи ВИЧ.
"""

question_3_wrong_answer_ru = """
Приём антиретровирусной терапии (АРТ) во время беременности является наиболее эффективным способом предотвращения передачи ВИЧ от матери ребенку. 
АРТ может снизить количество ВИЧ в крови матери, тем самым снижая риск передачи инфекции ребенку. 
Для беременных женщин, живущих с ВИЧ, крайне важно получать надлежащую медицинскую помощь, включая АРТ, под руководством медицинских работников. 
Отказ от грудного вскармливания (б) может еще больше снизить риск передачи инфекции, важно отметить, 
что в определенных ситуациях польза от грудного вскармливания может перевешивать риски, 
иногда следует обсудить альтернативные методы кормления. Кесарево сечение (в) может быть рекомендовано в особых случаях, 
когда вирусная нагрузка высока или другие факторы повышают риск передачи инфекции, но сам по себе это не самый эффективный метод.
"""

question_4_wrong_answer_ru = """
ВИЧ может передаваться через определённые биологические жидкости, включая кровь, сперму, выделения из влагалища и грудное молоко. 
Однако важно отметить, что вирус не может передаваться через случайные контакты, такие как объятия, рукопожатие или через повседневную деятельность. 
Передача ВИЧ требует прямого контакта со специфическими биологическими жидкостями, упомянутыми выше, которые содержат достаточное количество вируса.
"""

question_5_wrong_answer_ru = """
Рекомендуемая стратегия тестирования на ВИЧ включает ежеквартальное тестирование сексуально активных людей или людей с факторами риска. 
Регулярное тестирование на ВИЧ имеет решающее значение для раннего выявления, поскольку позволяет своевременно принять меры и получить доступ к надлежащему уходу и лечению. 
Тестирование на ВИЧ не должно ограничиваться теми, у кого есть симптомы, поскольку вирус может присутствовать в организме в течение длительного периода времени, не вызывая заметных симптомов. 
Таким образом, люди, ведущие половую жизнь или совершающие действия, сопряженные с риском передачи ВИЧ, должны регулярно проходить тестирование для обеспечения ранней диагностики и предотвращения дальнейшей передачи.
"""

question_6_wrong_answer_ru = """
ДКП расшифровывается как доконтактная профилактика, представляющая собой превентивный подход к снижению риска заражения ВИЧ у людей с высоким риском инфицирования вирусом. 
ДКП включает в себя прием лекарств под названием Truvada или Descovy, которые представляют собой комбинированные препараты, содержащие два антиретровирусных препарата (тенофовира дизопроксила фумарат и эмтрицитабин). 
При последовательном приёме ДКП может эффективно снизить риск инфицирования ВИЧ в результате полового акта или употребления инъекционных наркотиков. 
Важно отметить, что ДКП — это не лекарство от ВИЧ, а дополнительный инструмент профилактики, который при использовании в сочетании с другими профилактическими мерами, 
такими как использование презервативов, может значительно снизить риск передачи ВИЧ.
Постконтактная профилактика (ПКП) (б) является еще одной профилактической стратегией, но она включает приём антиретровирусных препаратов после возможного контакта с ВИЧ, 
например, в результате незащищённого полового акта или укола инфицированной иглой. 
Первичная эффективная защита (в) не является признанным термином в контексте профилактики ВИЧ.
"""

question_7_wrong_answer_ru = """
Использование общих игл для употребления наркотиков является примером поведения, связанного с высоким риском инфицирования ВИЧ. Когда иглы или другие принадлежности для наркотиков используются совместно с людьми, употребляющими инъекционные наркотики, существует значительный риск передачи ВИЧ, если один или несколько человек уже инфицированы. Это связано с тем, что совместное использование игл может напрямую ввести вирус в кровоток, способствуя передаче ВИЧ.

С другой стороны, а) Защищённый секс с моногамным партнёром — пример ответственного поведения, снижающий риск передачи ВИЧ. Постоянное использование презервативов и вступление в половую жизнь в рамках взаимно моногамных отношений с неинфицированным партнёром являются эффективными способами предотвращения передачи ВИЧ.

Волонтерство в местной благотворительной организации (в) не имеет прямого отношения к поведению, связанному с высоким риском инфицирования ВИЧ. Риск передачи ВИЧ в первую очередь связан с конкретными действиями, такими как незащищенный секс, совместное использование игл или другими видами поведения, связанными с контактом с инфицированными ВИЧ биологическими жидкостями.
"""

question_8_wrong_answer_ru = """
ВИЧ (вирус иммунодефицита человека) — это вирус, который атакует иммунную систему, особенно клетки CD4 (также известные как Т-хелперные клетки). Эти клетки играют решающую роль в координации иммунного ответа против инфекций. ВИЧ инфицирует клетки CD4, размножается внутри них и постепенно разрушает их, со временем ослабляя иммунную систему. В результате организм становится более восприимчивым к различным инфекциям и онкологическим заболеваниям. В настоящее время от ВИЧ нет лекарства, и, несмотря на значительные успехи в области антиретровирусной терапии (АРТ), которая может эффективно контролировать вирус и продлевать жизнь людей, живущих с ВИЧ, лекарство еще не разработано.

Важно отметить, что ВИЧ не может передаваться через укусы комаров. Вирус в основном распространяется через определенные биологические жидкости, включая кровь, сперму, вагинальные выделения и грудное молоко, при выполнении определенных действий, таких как незащищенный половой акт, совместное использование игл или шприцев, или путем передачи от матери ребёнку во время родов или грудного вскармливания. Комары не передают ВИЧ, поскольку вирус не может размножаться в организме комара и не присутствует в их слюне.
"""

question_9_wrong_answer_ru = """
Рекомендуемым лечением ВИЧ является антиретровирусная терапия (АРТ). АРТ включает в себя приём комбинации антиретровирусных препаратов для подавления репликации вируса в организме, замедления прогрессирования ВИЧ-инфекции и сохранения иммунной системы. Это стандартное лечение ВИЧ, и было доказано, что оно очень эффективно в борьбе с вирусом и улучшении здоровья и продолжительности жизни людей, живущих с ВИЧ.

Лекарственные травы (б) не рекомендуются в качестве основного лечения ВИЧ. Хотя дополнительные и альтернативные методы лечения иногда используются наряду с АРТ для лечения определенных симптомов или поддержания общего состояния здоровья, они не считаются заменой антиретровирусной терапии.

Лечение недоступно (в) — неверный ответ. Существуют эффективные методы лечения ВИЧ в виде антиретровирусной терапии.
"""

question_10_wrong_answer_ru = """

Неопределяемая вирусная нагрузка относится к уровню ВИЧ в кровотоке, который настолько низок, что не может быть обнаружен стандартными лабораторными тестами. Это не означает, что человек излечился от ВИЧ (а). Это указывает на то, что антиретровирусная терапия (АРТ) эффективно подавляет репликацию вируса. Достижение и поддержание неопределяемой вирусной нагрузки является основной целью лечения ВИЧ. Исследования показали, что если у человека, живущего с ВИЧ, сохраняется неопределяемая вирусная нагрузка в течение как минимум шести месяцев, он не может передать вирус своим половым партнёрам. Эта концепция известна как «неопределяемый = не передающий» или Н=Н.

Тест, используемый для определения того, подвергается ли кто-либо риску инфицирования ВИЧ (в), является неправильным ответом. Неопределяемая вирусная нагрузка — это мера количества ВИЧ у человека, который уже живёт с ВИЧ и получает лечение.
"""

question_11_wrong_answer_ru = """
Обычно требуется около 3 месяцев (90 дней), чтобы тест на ВИЧ обнаружил вирус после инфицирования. Это называется периодом окна — временем между инфицированием ВИЧ и временем, когда вирус может быть достоверно обнаружен с помощью стандартных тестов на ВИЧ. В период окна организм всё ещё может вырабатывать антитела к ВИЧ, а вирусная нагрузка может быть недостаточно высокой, чтобы её можно было обнаружить. Чтобы обеспечить точные результаты теста, обычно рекомендуется подождать не менее 3 месяцев после потенциального контакта с ВИЧ, прежде чем проходить тестирование. В некоторых случаях специализированные тесты, такие как тест на нуклеиновые кислоты (NAT), могут выявить вирус раньше, но обычно они не используются в качестве рутинных скрининговых тестов.
"""

question_12_wrong_answer_ru = """
Незащищённый анальный или вагинальный секс без использования презервативов представляет собой поведение с высокой степенью риска, которое может увеличить вероятность передачи ВИЧ. Во время полового акта может происходить обмен телесными жидкостями, такими как сперма, вагинальные выделения и кровь, что даёт возможность для передачи вируса от инфицированного партнера к неинфицированному партнеру. Важно практиковать безопасный секс, постоянно и правильно используя презервативы, чтобы снизить риск передачи ВИЧ.

Использование стерильных игл для инъекций наркотиков (а) на самом деле является практикой снижения вреда, которая снижает риск передачи ВИЧ среди людей, употребляющих инъекционные наркотики. Стерильные иглы и шприцы помогают предотвратить совместное использование оборудования, которое может привести к прямой передаче вируса. Крайне важно содействовать доступу к стерильному инъекционному инструментарию и услугам снижения вреда, чтобы предотвратить распространение ВИЧ среди людей, употребляющих инъекционные наркотики.

Наличие длительных моногамных отношений (в), когда оба партнера не инфицированы, само по себе не увеличивает риск передачи ВИЧ. Однако важно, чтобы люди, состоящие в сексуальных отношениях любого типа, знали о своем ВИЧ-статусе и ВИЧ-статусе своего партнера и участвовали в открытом и честном разговоре о сексуальном здоровье.
"""

question_13_wrong_answer_ru = """
Приверженность лечению ВИЧ-инфекции, которое включает в себя постоянный приём антиретровирусной терапии (АРТ) в соответствии с предписаниями, имеет решающее значение для предотвращения развития лекарственной устойчивости. ВИЧ — это вирус с высокой степенью изменчивости, и непринятие лекарств в соответствии с предписаниями может позволить вирусу размножаться и мутировать таким образом, что он станет устойчивым к действию лекарств. Это может серьезно ограничить будущие варианты лечения и снизить эффективность доступных лекарств. Соблюдение предписанного режима лечения помогает поддерживать вирусную супрессию, контролировать вирус и снижать риск развития лекарственной устойчивости.

Повышенный риск передачи инфекции другим людям (б) неверно. Соблюдение режима лечения ВИЧ фактически снижает риск передачи вируса другим людям. Когда человек постоянно принимает назначенные ему лекарства и достигает неопределяемой вирусной нагрузки, его риск передачи ВИЧ половым партнерам значительно снижается в соответствии с концепцией «неопределяемый = не передающий» или Н=Н.

Соблюдение режима лечения ВИЧ влияет на эффективность лечения (в). Регулярный приём антиретровирусных препаратов в соответствии с предписаниями необходим для обеспечения максимальной эффективности лечения и сохранения долгосрочных результатов в отношении здоровья людей, живущих с ВИЧ.
"""

question_14_wrong_answer_ru = """
Основная цель лечения ВИЧ – подавить вирус и сохранить общее состояние здоровья. При соблюдении назначенной антиретровирусной терапии (АРТ) можно подавить репликацию вируса ВИЧ в организме, что помогает сохранить иммунную функцию, снизить риск оппортунистических инфекций и улучшить общее самочувствие. Основная цель заключается в достижении и поддержании неопределяемой вирусной нагрузки, что не только улучшает здоровье человека, но и значительно снижает риск передачи вируса другим людям.
"""

question_15_wrong_answer_ru = """
Известно, что тошнота (а) и утомляемость (б) являются частыми побочными эффектами антиретровирусной терапии (АРТ) при ВИЧ. Многие антиретровирусные препараты могут вызывать побочные эффекты со стороны желудочно-кишечного тракта, включая тошноту, особенно на начальных этапах лечения. Усталость также является часто упоминаемым побочным эффектом АРТ, хотя она может иметь различные основные причины, такие как само лекарство, факторы, связанные с ВИЧ, или другие факторы, такие как образ жизни и сопутствующие заболевания.

Повышенный аппетит (в) обычно не связан с антиретровирусной терапией. Хотя у некоторых людей с ВИЧ могут возникать изменения аппетита, они чаще связаны с самой инфекцией или другими факторами, такими как метаболические изменения, психологические факторы или одновременный приём других лекарств. Обычно не известно, что антиретровирусная терапия непосредственно вызывает повышение аппетита в качестве общего побочного эффекта. Важно отметить, что индивидуальный опыт побочных эффектов может различаться, и всегда рекомендуется проконсультироваться с лечащим врачом для получения индивидуальной информации и рекомендаций относительно конкретных лекарств и потенциальных побочных эффектов.
"""

question_16_wrong_answer_ru = """
Благодаря достижениям в области медицины и надлежащему вмешательству люди, живущие с ВИЧ, могут иметь детей, не передавая вирус своим партнерам или детям. Вспомогательные репродуктивные технологии, такие как промывание спермы, экстракорпоральное оплодотворение (ЭКО) и доконтактная профилактика (ДКП) для ВИЧ-отрицательного партнера, могут значительно снизить риск передачи ВИЧ во время зачатия. Эти методы помогают гарантировать, что сперма или эмбрион, используемые для зачатия, не содержат ВИЧ. Кроме того, при надлежащем дородовом уходе, мониторинге и соблюдении рекомендуемых мер риск передачи инфекции от матери ребенку во время беременности, родов и грудного вскармливания может быть значительно снижен до очень низкого уровня.

Вариант (а) неверен. При соответствующих вмешательствах и соблюдении рекомендуемых стратегий риск передачи ВИЧ во время зачатия и беременности можно свести к минимуму.

Вариант (в) неверен. ВИЧ-статус обоих родителей на момент зачатия не определяет возможность рождения детей без передачи вируса. Вспомогательные репродуктивные технологии и соблюдение профилактических мер являются ключевыми факторами снижения риска передачи ВИЧ при зачатии и беременности.
"""

question_17_wrong_answer_ru = """
Под стигмой ВИЧ понимают дискриминацию, предрассудки и негативное отношение, с которыми люди, живущие с ВИЧ, часто сталкиваются из-за своего ВИЧ-статуса. Она включает в себя социальное неприятие, стереотипы и навешивание ярлыков, которые могут привести к маргинализации и жестокому обращению с людьми с ВИЧ. Стигма может проявляться в различных формах, таких как социальная изоляция, словесные оскорбления, потеря возможностей трудоустройства, отказ в медицинских услугах и даже насилие. Стигматизация в связи с ВИЧ может иметь серьезные негативные последствия для благополучия и психического здоровья людей, живущих с ВИЧ, а также может способствовать нежеланию людей обращаться за тестированием, лечением и поддержкой в связи с ВИЧ.
"""

question_18_wrong_answer_ru = """
Фонд Элтона Джона по борьбе со СПИДом (EJAF) — известная организация, работающая в поддержку людей, живущих с ВИЧ. Он был основан известным музыкантом сэром Элтоном Джоном в 1992 году и занимается финансированием программ и инициатив, связанных с профилактикой, лечением, уходом и поддержкой в связи с ВИЧ. Фонд работает по всему миру, чтобы повышать осведомленность, бороться со стигмой и дискриминацией, а также защищать права и благополучие людей, пострадавших от ВИЧ/СПИДа. Благодаря своим грантам и партнёрским отношениям Фонд Элтона Джона по борьбе со СПИДом поддерживает различные общественные организации, поставщиков медицинских услуг и группы защиты интересов, напрямую работающие с людьми, живущими с ВИЧ.

Всемирная организация здравоохранения (ВОЗ) (а) является специализированным учреждением Организации Объединенных Наций, которое предоставляет рекомендации и поддержку странам в вопросах общественного здравоохранения. Хотя ВОЗ активно работает в области ВИЧ, ее сфера деятельности выходит за рамки ВИЧ и охватывает широкий круг вопросов здравоохранения и глобальных приоритетов в области здравоохранения.

Организация Объединенных Наций по вопросам образования, науки и культуры (ЮНЕСКО) (б) уделяет особое внимание образовательным, научным, культурным и коммуникационным аспектам. Хотя ЮНЕСКО может косвенно способствовать поддержке ВИЧ через свои образовательные и культурные программы, она не является в первую очередь организацией, ориентированной на поддержку людей, живущих с ВИЧ.
"""


result_ratings_kz = {
    "small": small_result_kz,
    "high": high_result_kz,
    "medium": medium_result_kz
}

result_ratings_ru = {
    "small": small_result_ru,
    "high": high_result_ru,
    "medium": medium_result_ru
}
# ТЕКСТЫ ВОПРОСОВ НА ДВУХ ЯЗЫКАХ
question_1_ru_text = """
Как в основном передается ВИЧ?

A) При случайном контакте

B) Через зараженную пищу и воду

C) При половом контакте, совместном использовании игл и передаче инфекции от матери ребенку 
"""

question_2_ru_text = """
Что из перечисленного НЕ является методом профилактики передачи ВИЧ?

A) Постоянное и правильное использование презервативов

B) Воздержание от половой жизни

C) Совместное использование игл с другими 
"""

question_3_ru_text = """
Какой самый эффективный метод профилактики передачи ВИЧ от матери ребенку?

A) Прием антиретровирусной терапии во время беременности

B) Отказ от грудного вскармливания

C) Кесарево сечение
"""

question_4_ru_text = """
Какая из следующих жидкостей организма может передавать ВИЧ?

A) Пот
B) Слюна
C) Кровь
"""

question_5_ru_text = """
Какова рекомендуемая стратегия тестирования на ВИЧ?

A) Тестирование каждые 10 лет независимо от факторов риска

B) Ежеквартальное тестирование сексуально активных людей или людей с факторами риска 

C) Тестирование только при наличии симптомов ВИЧ-инфекции
"""

question_6_ru_text = """
Что означает ДКП в контексте профилактики ВИЧ?

A) Доконтактная профилактика 
B) Постконтактная профилактика
C) Первичная эффективная защита
"""

question_7_ru_text = """
Что из нижеперечисленного является примером поведения, связанного с высоким риском инфицирования ВИЧ?

A) Защищённый секс с моногамным партнером

B) Использование общих игл для употребления наркотиков

C) Волонтерство в местной благотворительной организации
"""

question_8_ru_text = """
Какое из следующих утверждений о ВИЧ верно?

A) В настоящее время существует лекарство от ВИЧ 

B) ВИЧ может передаваться через укусы комаров

C) ВИЧ атакует иммунную систему, особенно клетки CD4
"""

question_9_ru_text = """
Какое рекомендуемое лечение при ВИЧ?

A) Антиретровирусная терапия (АРТ)
B) Лечебные травы
C) Лечение недоступно

"""

question_10_ru_text = """
Что такое неопределяемая вирусная нагрузка?

A) Признак того, что человек излечился от ВИЧ

B) Показатель количества ВИЧ в кровотоке

C) Тест, используемый для определения того, подвержен ли кто-либо риску заражения ВИЧ.
"""

question_11_ru_text = """
Сколько времени обычно требуется тесту на ВИЧ для обнаружения вируса после инфицирования?

A) 1 день
B) 1 неделя
C) 3 месяца
"""

question_12_ru_text = """
Что из следующего может увеличить риск передачи ВИЧ?

A) Использование стерильных игл для инъекций наркотиков

B) Незащищённый анальный или вагинальный секс

C) Нахождение в длительных моногамных отношениях
"""

question_13_ru_text = """
В чем важность соблюдения режима лечения ВИЧ?

A) Предотвращает развитие лекарственной устойчивости 

B) Увеличивает риск передачи инфекции другим людям

C) Не влияет на эффективность лечения
"""

question_14_ru_text = """
Какова основная цель лечения ВИЧ?

A) Для лечения ВИЧ

B) Для лечения симптомов

C) Для подавления вируса и поддержания общего состояния здоровья 
"""

question_15_ru_text = """
Что из следующего НЕ является частым побочным эффектом антиретровирусной терапии?

A) Тошнота
B) Усталость
C) Повышенный аппетит
"""

question_16_ru_text = """
Могут ли люди, живущие с ВИЧ, иметь детей без передачи вируса?

A) Нет, передача неизбежна

B) Да, с помощью вспомогательных репродуктивных технологий 

C) Могут, если на момент зачатия оба родителя не были ВИЧ-инфицированными
"""

question_17_ru_text = """
Что такое стигма ВИЧ?

A) Положительное социальное восприятие ВИЧ-позитивных лиц

B) Дискриминация и негативное отношение к людям, живущим с ВИЧ

C) Медицинский термин, обозначающий запущенную стадию ВИЧ-инфекции
"""

question_18_ru_text = """
Что из перечисленного является примером организации, работающей в поддержку людей, живущих с ВИЧ?

A) Всемирная организация здравоохранения (ВОЗ)

B) Организация Объединенных Наций по вопросам образования, науки и культуры (ЮНЕСКО)

C) Фонд Элтона Джона по борьбе со СПИДом
"""


question_1_ru = {
    "question_text": question_1_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_1_wrong_answer_ru
}

question_2_ru = {
    "question_text": question_2_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_2_wrong_answer_ru
}

question_3_ru = {
    "question_text": question_3_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '0',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_3_wrong_answer_ru
}

question_4_ru = {
    "question_text": question_4_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_4_wrong_answer_ru
}

question_5_ru = {
    "question_text": question_5_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_5_wrong_answer_ru
}

question_6_ru = {
    "question_text": question_6_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_6_wrong_answer_ru
}

question_7_ru = {
    "question_text": question_7_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '1',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_7_wrong_answer_ru
}

question_8_ru = {
    "question_text": question_8_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '00',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_8_wrong_answer_ru
}

question_9_ru = {
    "question_text": question_9_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_9_wrong_answer_ru
}

question_10_ru = {
    "question_text": question_10_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '1',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_10_wrong_answer_ru
}

question_11_ru = {
    "question_text": question_11_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_11_wrong_answer_ru
}

question_12_ru = {
    "question_text": question_12_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_12_wrong_answer_ru
}

question_13_ru = {
    "question_text": question_13_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_13_wrong_answer_ru
}

question_14_ru = {
    "question_text": question_14_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_14_wrong_answer_ru
}

question_15_ru = {
    "question_text": question_15_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '00',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_15_wrong_answer_ru
}

question_16_ru = {
    "question_text": question_16_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_16_wrong_answer_ru
}

question_17_ru = {
    "question_text": question_17_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '1',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_17_wrong_answer_ru
}

question_18_ru = {
    "question_text": question_18_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_18_wrong_answer_ru
}

questions_ru = \
    {
        "question_1": question_1_ru,
        "question_2": question_2_ru,
        "question_3": question_3_ru,
        "question_4": question_4_ru,
        "question_5": question_5_ru,
        "question_6": question_6_ru,
        "question_7": question_7_ru,
        "question_8": question_8_ru,
        "question_9": question_9_ru,
        "question_10": question_10_ru,
        "question_11": question_11_ru,
        "question_12": question_12_ru,
        "question_13": question_13_ru,
        "question_14": question_14_ru,
        "question_15": question_15_ru,
        "question_16": question_16_ru,
        "question_17": question_17_ru,
        "question_18": question_18_ru,
    }
