high_result_ru = """
Оценка 11-15:
Отличное понимание - Поздравляем! Вы имеете чёткое представление о жизни ЛЖВ, развеиваете мифы и заблуждения. Ваши знания отражают уважительное и точное понимание проблем, с которыми сталкиваются ЛЖВ.
"""

medium_result_ru = """
Оценка 6-10:
Среднее понимание – Ваши знания о жизни ЛЖВ приличные, но есть возможности для улучшения. Продолжайте учиться и бороться с неправильными представлениями, чтобы способствовать более точному пониманию.
"""

small_result_ru = """
Оценка 0-5: 
Ограниченное понимание. Судя по вашим ответам, в ваших знаниях о жизни ЛЖВ имеются некоторые неверные представления и пробелы. Рассмотрите возможность узнать больше о ВИЧ, стигме, дискриминации и правах ЛЖВ.
"""

high_result_kz = """

"""

medium_result_kz = """

"""

small_result_kz = """

"""

question_1_wrong_answer_ru = """
Люди, живущие с ВИЧ, могут иметь абсолютно нормальные, здоровые отношения с другими людьми. ВИЧ не определяет способность человека любить, общаться или иметь полноценные отношения. При надлежащем медицинском уходе, лечении и соблюдении профилактических мер риск передачи ВИЧ можно значительно снизить, что позволяет ЛЖВ вести полноценную жизнь и поддерживать здоровые отношения.
"""

question_2_wrong_answer_ru = """
Под стигмой в связи с ВИЧ понимают дискриминацию, предрассудки и негативное отношение, с которыми люди, живущие с ВИЧ, часто сталкиваются из-за своего ВИЧ-статуса. Он включает в себя социальное неприятие, стереотипы и навешивание ярлыков, которые могут привести к маргинализации и жестокому обращению с людьми с ВИЧ. Стигма может проявляться в различных формах, таких как социальная изоляция, словесные оскорбления, потеря возможностей трудоустройства, отказ в медицинских услугах и даже насилие. Важно бороться со стигмой в связи с ВИЧ, чтобы создать более инклюзивное и поддерживающее общество для ЛЖВ.
"""

question_3_wrong_answer_ru = """
Дискриминация в отношении людей, живущих с ВИЧ, может происходить в различных условиях, включая медицинские учреждения, школы и учебные заведения, а также на работе. Люди с ВИЧ могут столкнуться с несправедливым обращением, отказом в услугах, стигматизирующим поведением и негативным отношением. Важно повышать осведомленность, продвигать образование и отстаивать права ЛЖВ для предотвращения дискриминации и обеспечения равного обращения и возможностей для всех.
"""

question_4_wrong_answer_ru = """
ВИЧ не может передаваться воздушно-капельным путем, например, при кашле или чихании. ВИЧ в основном передаётся определенными путями, включая незащищённый половой контакт, совместное использование игл или инструментов для инъекций, а также передачу от матери к ребенку во время родов или грудного вскармливания. Важно развеять неверные представления о передаче ВИЧ, чтобы способствовать получению точных знаний и пониманию вируса.
"""

question_5_wrong_answer_ru = """
Люди, живущие с ВИЧ, имеют право работать в большинстве профессий без дискриминации. Дискриминация на основании ВИЧ-статуса несправедлива и противоречит принципам равенства и прав человека. Многие страны приняли законы и правила для защиты прав ЛЖВ на рабочем месте, гарантируя, что они не будут подвергаться дискриминации на основании их ВИЧ-статуса. Тем не менее, важно повышать осведомленность, бороться со стигмой и продвигать политику на рабочем месте, поддерживающую права ЛЖВ.
"""

question_6_wrong_answer_ru = """
С развитием антиретровирусной терапии (АРТ) и всестороннего медицинского обслуживания ЛЖВ могут жить долгой и здоровой жизнью. Антиретровирусное лечение подавляет репликацию вируса ВИЧ, позволяя иммунной системе восстанавливаться и эффективно функционировать. Регулярное медицинское обслуживание, приверженность лечению и выбор здорового образа жизни способствуют благополучию и долголетию ЛЖВ. Важно поощрять доступ к системам лечения и поддержки, повышающим качество жизни ЛЖВ.
"""

question_7_wrong_answer_ru = """
Основная цель лечения ВИЧ – подавить вирус в организме до неопределяемого уровня и сохранить общее состояние здоровья и благополучия. Антиретровирусная терапия (АРТ) играет решающую роль в подавлении вируса, что снижает риск осложнений, связанных с ВИЧ, и передачи инфекции другим людям. АРТ помогает сохранить иммунную систему, улучшить качество жизни ЛЖВ и предотвратить прогрессирование ВИЧ в СПИД.
"""

question_8_wrong_answer_ru = """
Многие страны приняли законы и правила для защиты прав ЛЖВ и предотвращения дискриминации по признаку ВИЧ-статуса. Эти законы направлены на обеспечение равного обращения, защиту прав на здравоохранение, образование, трудоустройство, неприкосновенность частной жизни и недискриминацию для ЛЖВ. Однако уровень правовой защиты может варьироваться в зависимости от страны. Постоянно предпринимаются усилия по защите более сильной правовой базы и созданию благоприятной и инклюзивной среды для ЛЖВ во всем мире.
"""

question_9_wrong_answer_ru = """
Многие страны приняли законы и правила для защиты прав ЛЖВ и предотвращения дискриминации по признаку ВИЧ-статуса. Эти законы направлены на обеспечение равного обращения, защиту прав на здравоохранение, образование, трудоустройство, неприкосновенность частной жизни и недискриминацию для ЛЖВ. Однако уровень правовой защиты может варьироваться в зависимости от страны. Постоянно предпринимаются усилия по защите более сильной правовой базы и созданию благоприятной и инклюзивной среды для ЛЖВ во всем мире.
"""

question_10_wrong_answer_ru = """
ВИЧ не может передаваться через случайный контакт, такой как объятия или рукопожатие. Как упоминалось ранее, ВИЧ в основном передаётся определенными путями, включая незащищённый половой контакт, совместное использование игл или инструментов для инъекций, а также передачу от матери к ребенку. Важно развеять неправильные представления о передаче ВИЧ, чтобы уменьшить стигматизацию и обеспечить широкое понимание достоверной информации.
"""

question_11_wrong_answer_ru = """
Благодаря достижениям в области вспомогательных репродуктивных технологий и медицинских вмешательств ЛЖВ могут иметь детей, не передавая вирус своим партнёрам или детям. Такие методы, как промывание спермы, экстракорпоральное оплодотворение (ЭКО), доконтактная профилактика (ДКП) для неинфицированного партнёра и другие вмешательства, могут значительно снизить риск передачи во время зачатия и беременности. Для ЛЖВ важно проконсультироваться со специалистами здравоохранения, имеющими опыт в области ВИЧ и репродуктивного здоровья, чтобы изучить доступные варианты и принять обоснованные решения.
"""

question_12_wrong_answer_ru = """
Восприимчивость ЛЖВ к заболеваниям и инфекциям может варьироваться в зависимости от стадии ВИЧ-инфекции и общего состояния здоровья человека. На ранних стадиях ВИЧ-инфекции иммунная система остаётся относительно неповреждённой, но по мере прогрессирования инфекции и ослабления иммунной системы ЛЖВ могут становиться более восприимчивыми к оппортунистическим инфекциям и другим заболеваниям. Однако при надлежащем медицинском обслуживании, включая антиретровирусную терапию (АРТ) и регулярное медицинское обслуживание, можно поддерживать иммунную систему и значительно снизить риск инфекций. Поддержание общего состояния здоровья, соблюдение правил гигиены и получение рекомендуемых прививок также способствуют снижению риска инфекций для ЛЖВ.
"""

question_13_wrong_answer_ru = """
Лечение ВИЧ, особенно антиретровирусная терапия (АРТ), очень эффективно подавляет вирус ВИЧ и уменьшает его репликацию в организме. Когда ЛЖВ постоянно придерживаются АРТ, это может значительно снизить вирусную нагрузку, что, в свою очередь, значительно снижает риск передачи вируса половым партнёрам. Исследования показали, что поддержание неопределяемой вирусной нагрузки (известной как Н=Н, или «неопределяемый = не передающий») эффективно устраняет риск передачи ВИЧ половым путем. Однако важно отметить, что хотя лечение ВИЧ и снижает риск передачи, оно не устраняет его полностью. Безопасные сексуальные практики, такие как использование презервативов, и регулярное тестирование на другие инфекции, передающиеся половым путем (ИППП), по-прежнему рекомендуются для общего сексуального здоровья и профилактики.
"""

question_14_wrong_answer_ru = """
Исследования показали, что когда ЛЖВ получают эффективную антиретровирусную терапию (АРТ) и достигают и поддерживают неопределяемую вирусную нагрузку, риск передачи вируса их половым партнёрам эффективно устраняется. Эта концепция известна как Н=Н (неопределяемый = не передающий). Тем не менее, важно отметить, что постоянное использование презервативов и регулярное информирование о ВИЧ-статусе по-прежнему рекомендуются для дополнительной защиты и решения любых проблем в отношениях.
"""

question_15_wrong_answer_ru = """
Требования к раскрытию ВИЧ-статуса половым партнёрам могут различаться в зависимости от конкретных обстоятельств и законов каждой страны. В некоторых юрисдикциях могут существовать юридические требования о раскрытии ВИЧ-статуса половым партнёрам, в то время как в других законодательные обязательства могут отсутствовать. Однако следует подчеркнуть этические соображения и важность открытого и честного общения в интимных отношениях. ЛЖВ следует рассмотреть возможность обсуждения своего ВИЧ-статуса со своими сексуальными партнёрами, чтобы поддерживать доверие, совместно принимать обоснованные решения и обеспечивать благополучие обоих партнёров. Важно знать о законах и правилах, касающихся раскрытия информации о ВИЧ, в конкретной юрисдикции, где человек проживает или ведет половую жизнь.
"""

result_ratings_kz = {
    "small": small_result_kz,
    "high": high_result_kz,
    "medium": medium_result_kz
}

result_ratings_ru = {
    "small": small_result_ru,
    "high": high_result_ru,
    "medium": medium_result_ru
}
# ТЕКСТЫ ВОПРОСОВ НА ДВУХ ЯЗЫКАХ
question_1_ru_text = """
Люди, живущие с ВИЧ (ЛЖВ), могут иметь нормальные, здоровые отношения с другими людьми

A) Правда 
B) Ложь
C) Зависит от тяжести состояния
"""

question_2_ru_text = """
К чему относится стигма ВИЧ?

A) Положительное социальное восприятие ЛЖВ

B) Дискриминация и негативное отношение к ЛЖВ 

C) Медицинский термин для прогрессирующей ВИЧ-инфекции
"""

question_3_ru_text = """
Дискриминация в отношении ЛЖВ может происходить в какой из следующих ситуаций?

A) Медицинские учреждения
B) Школы и учебные заведения
C) Работа и условия рабочего места
D) Все вышеперечисленное 
"""

question_4_ru_text = """
Что из следующего НЕ является распространенным заблуждением относительно передачи ВИЧ?

A) ВИЧ может передаваться при случайном контакте

B) Комары могут распространять ВИЧ

C) Совместное использование еды или напитков может привести к передаче ВИЧ

D) ВИЧ может передаваться воздушно-капельным путем (например, при кашле или чихании) 
"""

question_5_ru_text = """
Разрешено ли людям, живущим с ВИЧ, работать по большинству профессий?

A) Да, если они раскрывают свой ВИЧ-статус своему работодателю

B) Нет, людям, живущим с ВИЧ, запрещены некоторые профессии

C) Да, люди, живущие с ВИЧ, имеют право работать в большинстве профессий без дискриминации 
"""

question_6_ru_text = """
Могут ли ЛЖВ прожить долгую и здоровую жизнь при надлежащем медицинском уходе и лечении?

A) Да, при наличии доступа к антиретровирусной терапии и регулярному медицинскому обслуживанию ЛЖВ могут прожить долгую и здоровую жизнь 

B) Нет, ВИЧ всегда прогрессирует в СПИД и приводит к сокращению продолжительности жизни

C) Это зависит от общего состояния здоровья и образа жизни человека.
"""

question_7_ru_text = """
Какова основная цель лечения ВИЧ?

A) вылечиться от ВИЧ

B) для лечения симптомов ВИЧ-инфекции

C) для подавления вируса и поддержания общего состояния здоровья 

D) для предотвращения передачи ВИЧ другим
"""

question_8_ru_text = """
Защищены ли ЛЖВ от дискриминации в большинстве стран?

A) Да, во многих странах действуют законы, защищающие ЛЖВ от дискриминации 

B) Нет, ЛЖВ не защищены законом от дискриминации ни в одной стране

C) Это зависит от страны, некоторые из них обеспечивают правовую защиту, а другие нет
"""

question_9_ru_text = """
Что из следующего является примером основного права человека, которое необходимо соблюдать для ЛЖВ?

A) Право на охрану здоровья и лечение

B) Право на неприкосновенность частной жизни и конфиденциальность

C) Право на образование и возможности трудоустройства

D) Все вышеперечисленное 
"""

question_10_ru_text = """
Может ли ВИЧ передаваться через случайные контакты, такие как объятия или рукопожатие?

A) Да, ВИЧ может передаваться при случайном контакте

B) Нет, ВИЧ не может передаваться при случайном контакте 

C) Зависит от вирусной нагрузки человека, живущего с ВИЧ
"""

question_11_ru_text = """
Могут ли ЛЖВ иметь детей, не передавая вирус своим партнерам или детям?

A) Нет, передача неизбежна

B) Да, с помощью вспомогательных репродуктивных технологий и медицинских вмешательств

C) Только в том случае, если партнёр также является ВИЧ-позитивным
"""

question_12_ru_text = """
Являются ли ЛЖВ более восприимчивыми к распространённым заболеваниям и инфекциям?

A) Да, ЛЖВ имеют ослабленную иммунную систему и более восприимчивы к заболеваниям

B) Нет, у ЛЖВ такой же иммунный ответ, как и у людей без ВИЧ

C) Зависит от стадии ВИЧ-инфекции и общего состояния здоровья человека 
"""

question_13_ru_text = """
Какое из следующих утверждений об эффективности лечения ВИЧ верно?

A) Лечение ВИЧ может вылечить инфекцию

B) Лечение ВИЧ не может предотвратить передачу инфекции половым партнерам

C) Лечение ВИЧ может значительно снизить риск передачи инфекции 
"""

question_14_ru_text = """
Могут ли ЛЖВ вступать в сексуальные отношения без передачи вируса своим партнёрам?

A) Нет, любая сексуальная активность связана с риском передачи ВИЧ

B) Да, если ЛЖВ постоянно пользуются презервативами и имеют неопределяемую вирусную нагрузку 

C) Это зависит от сексуальной практики и мер предосторожности, принимаемых ЛЖВ
"""

question_15_ru_text = """
Обязаны ли ЛЖВ раскрывать свой ВИЧ-статус своим половым партнёрам?

A) Да, это требование законодательства в большинстве стран

B) Нет, ЛЖВ имеют право решать, когда и кому раскрывать свой ВИЧ-статус

C) Это зависит от конкретных обстоятельств и законов каждой страны 
"""


question_1_ru = {
    "question_text": question_1_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_1_wrong_answer_ru
}

question_2_ru = {
    "question_text": question_2_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_2_wrong_answer_ru
}

question_3_ru = {
    "question_text": question_3_ru_text,
    "answers": {
        "Ответ A": '000',
        "Ответ B": '00',
        "Ответ C": '0',
        "Ответ D": '1'
    },
    "wrong_answer_case": question_3_wrong_answer_ru
}

question_4_ru = {
    "question_text": question_4_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '000',
        "Ответ C": '0',
        "Ответ D": '1'
    },
    "wrong_answer_case": question_4_wrong_answer_ru
}

question_5_ru = {
    "question_text": question_5_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_5_wrong_answer_ru
}

question_6_ru = {
    "question_text": question_6_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_6_wrong_answer_ru
}

question_7_ru = {
    "question_text": question_7_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '00',
        "Ответ C": '1',
        "Ответ D": '000'
    },
    "wrong_answer_case": question_7_wrong_answer_ru
}

question_8_ru = {
    "question_text": question_8_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '0',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_8_wrong_answer_ru
}

question_9_ru = {
    "question_text": question_9_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '000',
        "Ответ C": '00',
        "Ответ D": '1'
    },
    "wrong_answer_case": question_9_wrong_answer_ru
}

question_10_ru = {
    "question_text": question_10_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_10_wrong_answer_ru
}

question_11_ru = {
    "question_text": question_11_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '1',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_11_wrong_answer_ru
}

question_12_ru = {
    "question_text": question_12_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '00',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_12_wrong_answer_ru
}

question_13_ru = {
    "question_text": question_13_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_13_wrong_answer_ru
}

question_14_ru = {
    "question_text": question_14_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_14_wrong_answer_ru
}

question_15_ru = {
    "question_text": question_15_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '00',
        "Ответ C": '1'
    },
    "wrong_answer_case": question_15_wrong_answer_ru
}


questions_ru = \
    {
        "question_1": question_1_ru,
        "question_2": question_2_ru,
        "question_3": question_3_ru,
        "question_4": question_4_ru,
        "question_5": question_5_ru,
        "question_6": question_6_ru,
        "question_7": question_7_ru,
        "question_8": question_8_ru,
        "question_9": question_9_ru,
        "question_10": question_10_ru,
        "question_11": question_11_ru,
        "question_12": question_12_ru,
        "question_13": question_13_ru,
        "question_14": question_14_ru,
        "question_15": question_15_ru,
    }
