# ТЕКСТЫ С РЕХУЛЬТАТАМИ

# ВЫСОКИЙ РИСК
high_risk_ru = "РЕЗУЛЬТАТЫ\nВысокий риск:\n\n22-38 баллов – " \
            "У Вас довольно высокий риск инфицирования ВИЧ. Рекомендуем Вам как можно раньше начать ДКП " \
            "(это приём препаратов, которые снижают вероятность инфицирования ВИЧ на 98%. При этом 2% приходятся " \
            "скорее на погрешности в приёме препаратов, нежели на эффективность такой профилактики. Это значит, что " \
            "даже при незащищённом сексе с ВИЧ-позитивным человеком вероятность инфицирования сводится на нет). Вам " \
            "подойдет схема с ежедневным приемом препарата. Вы можете избежать инфицирования ВИЧ, если будете " \
            "принимать назначенный препарат регулярно, без пропусков и своевременно сдавать необходимые " \
            "клинико-лабораторные анализы.\n\nДополнительную информацию " \
            "Вы можете узнать у консультанта: @Community_friends_tg"
high_risk_kz = "РЕЗУЛЬТАТЫ\nВысокий риск:\n\n22-38 балл – Сізде АҚТҚ жұқтыру қаупі айтарлықтай жоғары. " \
               "PrEP мүмкіндігінше ертерек бастауды ұсынамыз. Сізге препаратты күнделікті қабылдау режимі қолайлы. " \
               "Тағайындалған дәрі-дәрмекті үзіліссіз, жүйелі түрде қабылдап, қажетті клиникалық және зертханалық " \
               "зерттеулерді дер кезінде өткізіп отырсаңыз, АИТВ-ны жұқтырудан аулақ бола аласыз.\n\nҚосымша ақпарат " \
               "алу үшін кеңесшіңізге хабарласыңыз: @Community_friends_tg"

# СРЕДНИЙ РИСК
medium_risk_ru = "РЕЗУЛЬТАТЫ\nСредний риск:\n\n7-21 балл" \
              " – у Вас есть риск инфицирования ВИЧ. Рекомендуем Вам начать ДКП (это приём препаратов, которые " \
              "снижают вероятность инфицирования ВИЧ на 98%. При этом 2% приходятся скорее на погрешности в приёме " \
              "препаратов, нежели на эффективность такой профилактики. Это значит, что даже при незащищёном сексе " \
              "с ВИЧ-позитивным человеком вероятность инфицирования сводится на нет) в ближайшее время. Вы можете " \
              "обсудить с врачом удобную для Вас схему приема препарата, главное соблюдать все медицинские " \
              "рекомендации, и Вы сможете избежать инфицирования ВИЧ.\n\nДополнительную информацию Вы можете узнать " \
              "у консультанта: @Community_friends_tg"

medium_risk_kz = "РЕЗУЛЬТАТЫ\nСредний риск:\n\n7-21 балл – АИТВ жұқтыру қаупі бар. PrEP мүмкіндігінше тезірек " \
                 "бастауды ұсынамыз. Сіз дәрігермен препаратты қабылдаудың ыңғайлы режимін талқылай аласыз, ең " \
                 "бастысы - барлық медициналық ұсыныстарды орындау, және сіз АИТВ-ны жұқтырудан аулақ бола " \
                 "аласыз.\n\nҚосымша ақпарат алу үшін кеңесшіңізге хабарласыңыз: @Community_friends_tg"

# НИЗКИЙ РИСК
small_risk_ru = "РЕЗУЛЬТАТЫ\nНизкий риск:\n\nМенее 7 баллов – у вас низкий риск инфицирования ВИЧ.\n\n" \
             "Дополнительную информацию о способах защиты " \
             "от ВИЧ и ИППП Вы можете узнать у консультанта: @Community_friends_tg"
small_risk_kz = "РЕЗУЛЬТАТЫ\nНизкий риск:\n\n7 баллдан аз – сізде АҚТҚ жұқтыру қаупі төмен. Өзіңізді АИТВ және " \
                "ЖЖБИ-ден қорғау жолдары туралы қосымша ақпарат алу үшін кеңесшіден сұрай аласыз: @Community_friends_tg"


# ТЕКСТЫ ВОПРОСОВ НА ДВУХ ЯЗЫКАХ
question_1_ru = "Ваш партнер является ВИЧ-положительным человеком?"
question_1_kz = "Сіздің серіктесіңіз АҚТҚ жұқты ма?"


question_2_ru = "Получает ли партнер препараты для лечения ВИЧ?"
buttons_2_ru = [
    ["Да", "0"],
    ["Нет", "2"],
    ["Не знаю", "1"]
]
question_2_kz = "Серіктес АИТВ-мен емдеу үшін АРТ қабылдап жатыр ма?"
buttons_2_kz = [
    ["Иә", "0"],
    ["Жоқ", "2"],
    ["Білмеймін", "1"]
]


question_3_ru = "Получает ли партнер препараты для лечения ВИЧ более 6 месяцев?"
buttons_3_ru = [
    ["Да", "0"],
    ["Нет", "2"],
    ["Не знаю", "1"]
]
question_3_kz = "Серіктес 6 айдан астам уақыт бойы АИТВ-ға қарсы дәрі-дәрмек қабылдаған ба?"
buttons_3_kz = [
    ["Иә", "0"],
    ["Жоқ", "2"],
    ["Білмеймін", "1"]
]


question_4_ru = "Регулярно ли вы обсуждаете приверженность партнера лечению ВИЧ (т.е. как минимум, раз в месяц)?"
buttons_4_ru = [
    ["Да", "0"],
    ["Нет", "1"]
]
question_4_kz = "Сіз серіктесіңіздің АҚТҚ-ны емдеуді ұстануын үнемі (яғни, айына бір рет) талқылайсыз ба?"
buttons_4_kz = [
    ["Иә", "0"],
    ["Жоқ", "1"]
]


question_5_ru = "Знаете ли Вы последние результаты определения вирусной нагрузки своего партнера?"
buttons_5_ru = [
    ["Да", "0"],
    ["Нет", "1"]
]
question_5_kz = "Сіз серіктесіңіздің соңғы вирустық жүктеме нәтижелерін білесіз бе?"
buttons_5_kz = [
    ["Иә", "0"],
    ["Жоқ", "1"]
]


question_6_ru = "Хотите ли Вы иметь общего ребенка со своим партнером?"
buttons_6_ru = [
    ["Да", "1"],
    ["Нет", "0"],
    ["Не задумывался/лась", "0"]
]
question_6_kz = "Серіктесіңізден балалы болғыңыз келе ме?"
buttons_6_kz = [
    ["Иә", "1"],
    ["Жоқ", "0"],
    ["Ойланбадым / тырыстым", "0"]
]


question_7_ru = "Постоянно ли Вы и Ваш партнер пользуетесь презервативами?"
buttons_7_ru = [
    ["Да", "0"],
    ["Нет", "1"]
]
question_7_kz = "Сіз және сіздің серіктесіңіз презервативтерді үнемі пайдаланасыз ба?"
buttons_7_kz = [
    ["Иә", "0"],
    ["Жоқ", "1"]
]


question_8_ru = "Указывают ли какие-то аспекты Вашей жизни на повышенный риск ВИЧ-инфицирования?"
buttons_8_ru = [
    ["Да", "2"],
    ["Нет", "0"],
    ["Не знаю", "1"]
]
question_8_kz = "Сіздің өміріңіздің қандай да бір аспектілері АҚТҚ жұқтыру қаупінің жоғарылауын көрсете ме?"
buttons_8_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"],
    ["Білмеймін", "1"]
]


question_9_ru = "Вы получали деньги, жилье, еду или подарки в обмен на секс?"
buttons_9_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_9_kz = "Сіз жыныстық қатынас үшін ақша, баспана, тамақ немесе сыйлықтар алдыңыз ба?"
buttons_9_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]


question_10_ru = "Вас принуждали к сексу против Вашей воли?"
buttons_10_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_10_kz = "Сіз өз еркіңізге қарсы жыныстық қатынасқа түсуге мәжбүр болдыңыз ба?"
buttons_10_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]


question_11_ru = "Вы подвергались физическому насилию или рукоприкладству со стороны другого лица, " \
                 "в том числе со стороны полового партнера?"
buttons_11_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_11_kz = "Сізге басқа адам, соның ішінде жыныстық серіктес тарапынан физикалық зорлық-зомбылық " \
                 "немесе ұрып-соғу болды ма?"
buttons_11_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]


question_12_ru = "Вы принимали  ПКП (постконтактная профилактика – 4-недельный курс антиретровирусных препаратов " \
                 "для ВИЧ-отрицательных людей, который назначается после ситуаций, влекущих заражение ВИЧ. " \
                 "Это может быть незащищённый половой контакт, инъекционное употребление наркотиков или контакт с " \
                 "биологическими жидкостями инфицированного человека) для предотвращения ВИЧ-инфицирования?"
buttons_12_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_12_kz = "Сіз АИВ-инфекциясы бар жағдайлардан кейін берілген PEP (экспозициядан кейінгі профилактика – " \
                 "АИТВ-теріс адамдарға арналған ретровирусқа қарсы препараттардың 4 апталық курсы) қабылдадыңыз. " \
                 "Бұл қорғалмаған жыныстық қатынас, инъекциялық есірткі қолдану немесе жұқтырған адамның дене " \
                 "сұйықтығымен әсер ету болуы мүмкін. адам) АИТВ инфекциясының алдын алу үшін?"
buttons_12_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]


question_13_ru = "У Вас были ИППП (инфекции, передающиеся половым путем: сифилис, гонорея, хламидиоз, " \
                 "трихомониаз, кандиломы)?"
buttons_13_ru = [
    ["Да", "1"],
    ["Нет", "0"],
    ["Не проверялся", "1"]
]
question_13_kz = "Сізде ЖЖБИ (жыныстық жолмен берілетін инфекциялар: мерез, гонорея, хламидиоз, трихомониаз, " \
                 "кондиломалар) болды ма?"
buttons_13_kz = [
    ["Иә", "1"],
    ["Жоқ", "0"],
    ["Тексерілмеген", "1"]
]


question_14_ru = "Вводили ли Вы инъекции препаратов или гормональных средств, используя общее инъекционное " \
                 "оборудование с кем-то другим?"
buttons_14_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_14_kz = "Сіз инъекциялық жабдықты басқа біреумен бөлісу кезінде есірткі немесе гормондарды енгіздіңіз бе?"
buttons_14_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]


question_15_ru = "Употребляли ли Вы легкие наркотики или психотропные препараты за последние полгода?"
buttons_15_ru = [
    ["Да", "3"],
    ["Нет", "0"]
]
question_15_kz = "Сіз соңғы алты айда жұмсақ препараттарды немесе психотроптық препараттарды қолдандыңыз ба?"
buttons_15_kz = [
    ["Иә", "3"],
    ["Жоқ", "0"]
]


question_16_ru = "За последние полгода:\nБыло ли у Вас несколько половых партнеров?"
buttons_16_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_16_kz = "Соңғы алты айда:\nСізде бірнеше жыныстық серіктес болды ма?"
buttons_16_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]


question_17_ru = "Были ли у Вас половые контакты без презерватива?"
buttons_17_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_17_kz = "Сіз презервативсіз жыныстық қатынаста болдыңыз ба?"
buttons_17_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]


question_18_ru = "Были ли у Вас половые контакты с людьми, ВИЧ-статус которых Вы не знаете?"
buttons_18_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_18_kz = "Сіз АИТВ статусын білмейтін адамдармен жыныстық қатынаста болдыңыз ба?"
buttons_18_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]


question_19_ru = "Подвержен ли кто-либо из Ваших партнеров риску ВИЧ-инфицирования?"
buttons_19_ru = [
    ["Да", "2"],
    ["Нет", "0"],
    ["Не знаю", "1"]
]
question_19_kz = "Сіздің серіктестеріңізде АҚТҚ жұқтыру қаупі бар ма?"
buttons_19_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"],
    ["Білмеймін", "1"]
]


question_20_ru = "Были ли у Вас половые контакты с ВИЧ-инфицированным лицом?"
buttons_20_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_20_kz = "АИТВ жұқтырған адаммен жыныстық қатынаста болдыңыз ба?"
buttons_20_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]


question_21_ru = "Занимались ли вы сексом с использованием психоактивных/наркотических веществ?"
buttons_21_ru = [
    ["Да", "2"],
    ["Нет", "0"]
]
question_21_kz = "Сіз психоактивті/есірткілермен жыныстық қатынаста болдыңыз ба?"
buttons_21_kz = [
    ["Иә", "2"],
    ["Жоқ", "0"]
]

