high_result_ru = """
Оценка 13-18: 
Продвинутые знания - Поздравляем! У вас есть четкое представление о ВИЧ, его передаче, профилактике, лечении и поддержке. Вы хорошо осведомлены в этой теме.
"""

high_result_kz = """

"""

medium_result_ru = """
Оценка 7–12:
Промежуточные знания — у вас хорошие знания о ВИЧ, но в вашем понимании есть некоторые пробелы. Продолжайте учиться и быть в курсе последней информации о ВИЧ.
"""

medium_result_kz = """

"""

small_result_ru = """
Оценка 0–6:
Базовые знания — у вас есть базовые знания о ВИЧ, но есть возможности для совершенствования. Подумайте о том, чтобы узнать больше о передаче ВИЧ, профилактике, лечении и поддержке людей, живущих с ВИЧ.
"""

small_result_kz = """

"""

result_ratings_kz = {
    "small": small_result_kz,
    "high": high_result_kz,
    "medium": medium_result_kz
}

result_ratings_ru = {
    "small": small_result_ru,
    "high": high_result_ru,
    "medium": medium_result_ru
}
# ТЕКСТЫ ВОПРОСОВ НА ДВУХ ЯЗЫКАХ
question_1_ru_text = """
Как в основном передается ВИЧ?

A) При случайном контакте

B) Через зараженную пищу и воду

C) При половом контакте, совместном использовании игл и передаче инфекции от матери ребенку 
"""

question_2_ru_text = """
Что из перечисленного НЕ является методом профилактики передачи ВИЧ?

A) Постоянное и правильное использование презервативов

B) Воздержание от половой жизни

C) Совместное использование игл с другими 
"""

question_3_ru_text = """
Какой самый эффективный метод профилактики передачи ВИЧ от матери ребенку?

A) Прием антиретровирусной терапии во время беременности

B) Отказ от грудного вскармливания

C) Кесарево сечение
"""

question_4_ru_text = """
Какая из следующих жидкостей организма может передавать ВИЧ?

A) Пот
B) Слюна
C) Кровь
"""

question_5_ru_text = """
Какова рекомендуемая стратегия тестирования на ВИЧ?

A) Тестирование каждые 10 лет независимо от факторов риска

B) Ежеквартальное тестирование сексуально активных людей или людей с факторами риска 

C) Тестирование только при наличии симптомов ВИЧ-инфекции
"""

question_6_ru_text = """
Что означает ДКП в контексте профилактики ВИЧ?

A) Доконтактная профилактика 
B) Постконтактная профилактика
C) Первичная эффективная защита
"""

question_7_ru_text = """
Что из нижеперечисленного является примером поведения, связанного с высоким риском инфицирования ВИЧ?

A) Защищённый секс с моногамным партнером

B) Использование общих игл для употребления наркотиков

C) Волонтерство в местной благотворительной организации
"""

question_8_ru_text = """
Какое из следующих утверждений о ВИЧ верно?

A) В настоящее время существует лекарство от ВИЧ 

B) ВИЧ может передаваться через укусы комаров

C) ВИЧ атакует иммунную систему, особенно клетки CD4
"""

question_9_ru_text = """
Какое рекомендуемое лечение при ВИЧ?

A) Антиретровирусная терапия (АРТ)
B) Лечебные травы
C) Лечение недоступно

"""

question_10_ru_text = """
Что такое неопределяемая вирусная нагрузка?

A) Признак того, что человек излечился от ВИЧ

B) Показатель количества ВИЧ в кровотоке

C) Тест, используемый для определения того, подвержен ли кто-либо риску заражения ВИЧ.
"""

question_11_ru_text = """
Сколько времени обычно требуется тесту на ВИЧ для обнаружения вируса после инфицирования?

A) 1 день
B) 1 неделя
C) 3 месяца
"""

question_12_ru_text = """
Что из следующего может увеличить риск передачи ВИЧ?

A) Использование стерильных игл для инъекций наркотиков

B) Незащищённый анальный или вагинальный секс

C) Нахождение в длительных моногамных отношениях
"""

question_13_ru_text = """
В чем важность соблюдения режима лечения ВИЧ?

A) Предотвращает развитие лекарственной устойчивости 

B) Увеличивает риск передачи инфекции другим людям

C) Не влияет на эффективность лечения
"""

question_14_ru_text = """
Какова основная цель лечения ВИЧ?

A) Для лечения ВИЧ

B) Для лечения симптомов

C) Для подавления вируса и поддержания общего состояния здоровья 
"""

question_15_ru_text = """
Что из следующего НЕ является частым побочным эффектом антиретровирусной терапии?

A) Тошнота
B) Усталость
C) Повышенный аппетит
"""

question_16_ru_text = """
Могут ли люди, живущие с ВИЧ, иметь детей без передачи вируса?

A) Нет, передача неизбежна

B) Да, с помощью вспомогательных репродуктивных технологий 

C) Могут, если на момент зачатия оба родителя не были ВИЧ-инфицированными
"""

question_17_ru_text = """
Что такое стигма ВИЧ?

A) Положительное социальное восприятие ВИЧ-позитивных лиц

B) Дискриминация и негативное отношение к людям, живущим с ВИЧ

C) Медицинский термин, обозначающий запущенную стадию ВИЧ-инфекции
"""

question_18_ru_text = """
Что из перечисленного является примером организации, работающей в поддержку людей, живущих с ВИЧ?

A) Всемирная организация здравоохранения (ВОЗ)

B) Организация Объединенных Наций по вопросам образования, науки и культуры (ЮНЕСКО)

C) Фонд Элтона Джона по борьбе со СПИДом
"""


question_1_ru = {
    "question_text": question_1_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 0,
        "Ответ C": 1
    }
}

question_2_ru = {
    "question_text": question_2_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 0,
        "Ответ C": 1
    }
}

question_3_ru = {
    "question_text": question_3_ru_text,
    "answers": {
        "Ответ A": 1,
        "Ответ B": 0,
        "Ответ C": 0
    }
}

question_4_ru = {
    "question_text": question_4_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 0,
        "Ответ C": 1
    }
}

question_5_ru = {
    "question_text": question_5_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 1,
        "Ответ C": 0
    }
}

question_6_ru = {
    "question_text": question_6_ru_text,
    "answers": {
        "Ответ A": 1,
        "Ответ B": 0,
        "Ответ C": 0
    }
}

question_7_ru = {
    "question_text": question_7_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 1,
        "Ответ C": 0
    }
}

question_8_ru = {
    "question_text": question_8_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 0,
        "Ответ C": 1
    }
}

question_9_ru = {
    "question_text": question_9_ru_text,
    "answers": {
        "Ответ A": 1,
        "Ответ B": 0,
        "Ответ C": 0
    }
}

question_10_ru = {
    "question_text": question_10_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 1,
        "Ответ C": 0
    }
}

question_11_ru = {
    "question_text": question_11_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 0,
        "Ответ C": 1
    }
}

question_12_ru = {
    "question_text": question_12_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 1,
        "Ответ C": 0
    }
}

question_13_ru = {
    "question_text": question_13_ru_text,
    "answers": {
        "Ответ A": 1,
        "Ответ B": 0,
        "Ответ C": 0
    }
}

question_14_ru = {
    "question_text": question_14_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 0,
        "Ответ C": 1
    }
}

question_15_ru = {
    "question_text": question_15_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 0,
        "Ответ C": 1
    }
}

question_16_ru = {
    "question_text": question_16_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 1,
        "Ответ C": 0
    }
}

question_17_ru = {
    "question_text": question_17_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 1,
        "Ответ C": 0
    }
}

question_18_ru = {
    "question_text": question_18_ru_text,
    "answers": {
        "Ответ A": 0,
        "Ответ B": 0,
        "Ответ C": 1
    }
}

questions_ru = \
    {
        "question_1": question_1_ru,
        "question_2": question_2_ru,
        "question_3": question_3_ru,
        "question_4": question_4_ru,
        "question_5": question_5_ru,
        "question_6": question_6_ru,
        "question_7": question_7_ru,
        "question_8": question_8_ru,
        "question_9": question_9_ru,
        "question_10": question_10_ru,
        "question_11": question_11_ru,
        "question_12": question_12_ru,
        "question_13": question_13_ru,
        "question_14": question_14_ru,
        "question_15": question_15_ru,
        "question_16": question_16_ru,
        "question_17": question_17_ru,
        "question_18": question_18_ru,
    }
