# ВЫСОКИЙ РИСК
high_result_ru = """
17-20 баллов:
Отлично! У вас есть всестороннее понимание о сексуальной ориентации и гендерной идентичности.
"""

medium_result_ru = """
10-16 баллов:
Хорошая работа! У вас есть солидная база знаний о сексуальной ориентации и гендерной идентичности.
"""

small_result_ru = """
0-9 баллов:
Продолжайте учиться! Есть возможности для улучшения вашего понимания о сексуальной ориентации и гендерной идентичности.
"""

high_result_kz = """

"""

medium_result_kz = """

"""

small_result_kz = """

"""

question_1_wrong_answer_ru = """
Биологический пол относится к физическим атрибутам и характеристикам, которые обычно используются для классификации людей как мужчин или женщин при рождении. 
Это определяется такими факторами, как репродуктивные органы, хромосомы и гормоны.
"""

question_2_wrong_answer_ru = """
Гендер относится к социальным и культурным ролям, поведению и ожиданиям, которые общество возлагает на людей в зависимости от их предполагаемого пола. 
Это сложная концепция, которая выходит за рамки биологического пола и включает такие элементы, 
как гендерная идентичность, гендерное самовыражение, а также социальные нормы и ожидания.
"""

question_3_wrong_answer_ru = """
Трансгендерный переход относится к процессу, через который проходят некоторые трансгендеры, 
чтобы согласовать свою гендерную идентичность с назначенным им полом при рождении. 
Этот процесс может включать социальные, медицинские и юридические аспекты, 
такие как изменение имени и местоимений, прохождение гормональной терапии и, возможно, хирургическое вмешательство.

Важно отметить, что сексуальная ориентация отличается от гендерной идентичности. 
Сексуальная ориентация относится к устойчивой модели эмоционального, романтического и / или сексуального влечения человека 
к мужчинам, женщинам, обоим полам или ни к одному из них.
"""

question_4_wrong_answer_ru = """
Сексуальная ориентация относится к устойчивой модели эмоционального, 
романтического и / или сексуального влечения человека к мужчинам, женщинам,
 обоим полам или ни к одному из них. Она отдельна от гендерной идентичности. 
"""

question_5_wrong_answer_ru = """
Объяснение: Интерсексуалы — это люди, которые рождаются с физическими половыми характеристиками 
(такими как хромосомы, гонады или гениталии), которые не соответствуют типичным определениям мужчины или женщины. 
Интерсекс — это естественная и разнообразная вариация в биологии человека.
"""

question_6_wrong_answer_ru = """
Гендер — это прежде всего социальная конструкция, которая включает в себя роли, 
поведение и ожидания, которые общество приписывает людям в зависимости от их предполагаемого пола. 
На него влияют культурные и социальные нормы, и он может варьироваться в зависимости от разных культур и исторических периодов.
"""

question_7_wrong_answer_ru = """
Небинарный — это общий термин, используемый для описания людей, 
чья гендерная идентичность не соответствует исключительно категориям мужчин или женщин.
Они могут идентифицировать себя как представители обоих полов, ни одного пола, комбинации полов или пола вне традиционной бинарной системы.
"""

question_8_wrong_answer_ru = """
Гетеронормативность относится к общественному предположению, 
что гетеросексуальность является нормой или сексуальной ориентацией по умолчанию. 
Это увековечивает идею о том, что отношения и поведение, которые соответствуют традиционным партнёрским 
отношениям между мужчиной и женщиной, лучше или более социально приемлемы.
"""

question_9_wrong_answer_ru = """
Сексуальная ориентация является глубоко укоренившимся аспектом личности человека, 
и для многих людей она остается неизменной на протяжении всей их жизни. 
Тем не менее, некоторые люди могут испытывать сдвиги или изменения в своей сексуальной ориентации с течением времени, 
включая изменения в влечениях, желаниях и самоидентификации. 
Сексуальная ориентация — это личный и индивидуальный опыт, который для некоторых людей может быть изменчивым.
"""

question_10_wrong_answer_ru = """
Гомосексуал — это термин, используемый для описания людей, которых в первую очередь привлекают люди того же пола.
"""

question_11_wrong_answer_ru = """ 
Цисгендер — это термин, используемый для описания людей, чья гендерная идентичность совпадает с полом, присвоенным им при рождении. 
Например, человек, которому при рождении приписывают женщину и который идентифицирует себя как женщина, является цисгендером.
"""

question_12_wrong_answer_ru = """ 
LGBTQ+ — это аббревиатура, обозначающая лесбиянок, геев, бисексуалов, трансгендеров и квир (или сомневающихся). 
«+» представляет другие разнообразные сексуальные ориентации и гендерные идентичности. 
Это всеобъемлющий термин, используемый для обозначения сообщества людей с негетеросексуальной ориентацией или нецисгендерной идентичностью.
"""

question_13_wrong_answer_ru = """ 
Местоимения — это лингвистические инструменты, используемые для обозначения людей таким образом, чтобы уважать их гендерную идентичность. 
Использование правильных местоимений для кого-то помогает признать и подтвердить свою личность.
"""

question_14_wrong_answer_ru = """ 
Каминг-аут относится к процессу раскрытия или раскрытия своей сексуальной ориентации или гендерной идентичности другим, 
часто в публичном или личном контексте. Это личное решение, которое позволяет людям выразить своё подлинное «я» и открыто заявить о своей принадлежности к ЛГБТК+.
"""

question_15_wrong_answer_ru = """ 
Понимание и принятие разнообразной сексуальной ориентации и гендерной идентичности 
способствует созданию более инклюзивного и справедливого общества. 
Оно помогает устранить дискриминацию и предрассудки, продвигая равные права и возможности для ЛГБТК+. 
Оно также поощряет уважение, сочувствие и прославление разнообразия внутри сообществ.
"""

question_16_wrong_answer_ru = """ 
Быть союзником означает активно поддерживать и отстаивать права, благополучие и равное обращение с представителями ЛГБТК+. 
Союзники проявляют понимание, сочувствие и солидарность с сообществом ЛГБТК+, 
работая над созданием более инклюзивного и принимающего общества.
"""

question_17_wrong_answer_ru = """ 
Цисгендеры относятся к людям, чья гендерная идентичность совпадает с полом, присвоенным им при рождении. 
Например, человек, которому при рождении приписана женщина и который идентифицирует себя как женщина, является цисгендером.
"""

question_18_wrong_answer_ru = """ 
Празднование гордости ЛГБТК + проводится в ознаменование истории, достижений и вклада сообщества ЛГБТК +. 
Оно также являетсяс редством повышения осведомлённости о проблемах ЛГБТК +, содействия принятию и отстаивания равных прав. 
Празднование прайда обеспечивает безопасное и благоприятное пространство для представителей ЛГБТК+, 
где они могут выразить свою идентичность, а для союзников — выразить свою поддержку.
"""

question_19_wrong_answer_ru = """ 
Гендерная дисфория относится к психологическому дистрессу или дискомфорту, который некоторые люди могут испытывать, 
когда пол, с которым они идентифицируют себя, отличается от пола, 
который им был присвоен при рождении. Это не связано напрямую с сексуальной ориентацией, 
а скорее с несоответствием между гендерной идентичностью и назначенным полом.
"""

question_20_wrong_answer_ru = """ 
Общество играет значительную роль в формировании гендерных ролей и стереотипов. 
Через процессы социализации и культурные нормы общество укрепляет определенные ожидания и модели поведения, 
связанные с мужественностью и женственностью. Средства массовой информации, в том числе реклама, фильмы и литература, 
часто изображают гендерные стереотипы, еще больше влияя на общественное восприятие и ожидания в отношении того, 
как должны вести себя мужчины и женщины.
"""


result_ratings_kz = {
    "small": small_result_kz,
    "high": high_result_kz,
    "medium": medium_result_kz
}

result_ratings_ru = {
    "small": small_result_ru,
    "high": high_result_ru,
    "medium": medium_result_ru
}
# ТЕКСТЫ ВОПРОСОВ НА ДВУХ ЯЗЫКАХ
question_1_ru_text = """
Биологический пол означает:

A) Присвоенный пол при рождении на основе физических характеристик

B) Сексуальная ориентация

C) Гендерная идентичность
"""

question_2_ru_text = """
Что такое гендер?

A) То же, что биологический пол

B) Социальная и культурная концепция, охватывающая роли, поведение и ожидания

C) Сексуальное влечение человека к другим
"""

question_3_ru_text = """
Что означает трансгендерный переход?

A) Процесс смены биологического пола

B) Процесс согласования своей гендерной идентичности с назначенным полом при рождении

C) Процесс перехода от одной сексуальной ориентации к другой
"""

question_4_ru_text = """
Сексуальная ориентация означает:

A) То же, что гендерная идентичность

B) Эмоциональное, романтическое или сексуальное влечение человека к другим

C) Процесс перехода от одного пола к другому
"""

question_5_ru_text = """
Что такое интерсекс люди?

A) Люди, не имеющие биологического пола

B) Люди, чья гендерная идентичность не соответствует общественным ожиданиям

C) Люди, рожденные с физическими половыми признаками, которые не соответствуют типичным определениям мужчин или женщин
"""

question_6_ru_text = """
Гендер – в первую очередь:

A) Определяется биологией и генетикой
B) Социальный конструкт, находящийся под влиянием культурных и социальных норм
C) То же, что и сексуальная ориентация
"""

question_7_ru_text = """
Небинарный означает:

A) Люди, которые идентифицируют себя как мужчинами, так и женщинами

B) Люди, которые не идентифицируют себя исключительно как мужчины или женщины

C) Люди, которых привлекают как мужчины, так и женщины
"""

question_8_ru_text = """
Что такое гетеронормативность?

A) Вера в то, что гетеросексуальность является единственно допустимой сексуальной ориентацией

B) Вера в то, что гендер является социальной конструкцией

C) Вера в то, что все люди имеют один и тот же биологический пол
"""

question_9_ru_text = """
Может ли со временем измениться чья-то сексуальная ориентация?

A) Нет, сексуальная ориентация фиксирована и неизменна

B) Да, сексуальная ориентация может развиваться или меняться на протяжении всей жизни человека

C) Сексуальная ориентация не имеет отношения к личности
"""

question_10_ru_text = """
Как правильно назвать того, кого привлекают люди того же пола?

A) Гомосексуал
B) Гетеросексуал
C) Бисексуал
"""

question_11_ru_text = """
Какой термин описывает кого-то, чья гендерная идентичность совпадает с назначенным полом при рождении?

A) Трансгендер
B) Цисгендер
C) Небинарный
"""

question_12_ru_text = """
Что означает ЛГБТК+?

A) Лесбиянки, геи, бисексуалы, трансгендеры, квир

B) Долголетие, Рост, Храбрость, Доверие, Качество

C) Любовь, Щедрость, Красота, Спокойствие, Причудливость
"""

question_13_ru_text = """
Каково назначение местоимений?

A) Они указывают на биологический пол человека

B) Они помогают людям относиться к другим уважительно и точно

C) Они раскрывают сексуальную ориентацию человека
"""

question_14_ru_text = """
Что значит сделать коминг-аут как ЛГБТК+?

A) Публично раскрывать свою сексуальную ориентацию или гендерную идентичность

B) Пройти медицинские процедуры по смене пола

C) Отвергать социальные нормы и ожидания
"""

question_15_ru_text = """
Какую пользу обществу приносит понимание и принятие разнообразной сексуальной ориентации и гендерной идентичности?

A) Оно способствует равенству, инклюзивности и уважению всех людей

B) Не влияет на общество

C) Это приводит к путанице и хаосу
"""

question_16_ru_text = """
Что значит быть союзником сообщества ЛГБТК+?

A) Идентифицировать себя как ЛГБТК+

B) Поддерживать и отстаивать права и благополучие представителей ЛГБТК+

C) Противодействовать правам ЛГБТК+
"""

question_17_ru_text = """
Что означает термин «цисгендер»?

A) Имеющие сексуальную ориентацию, отличную от гетеросексуальной

B) Идентификация с полом, присвоенным при рождении

C) Отвержение социальных норм пола
"""

question_18_ru_text = """
Какова цель празднования гордости ЛГБТК+?

A) Выставлять напоказ свою сексуальную ориентацию или гендерную идентичность

B) Повышать осведомленность о проблемах ЛГБТК+ и содействовать их принятию

C) Исключить людей, не являющихся ЛГБТК+
"""

question_19_ru_text = """
Что такое гендерная дисфория?

A) Заболевание, связанное с сексуальной ориентацией

B) Стресс или дискомфорт, возникающие, когда гендерная идентичность человека не соответствует назначенному ему при рождении полу

C) Процесс перехода от одного пола к другому
"""

question_20_ru_text = """
Как общество способствует формированию гендерных ролей и стереотипов?

A) Общество не влияет на гендерные роли и стереотипы

B) Общество усиливает и увековечивает гендерные роли и стереотипы посредством социализации и средств массовой информации

C) Гендерные роли и стереотипы основаны исключительно на биологических факторах
"""


question_1_ru = {
    "question_text": question_1_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_1_wrong_answer_ru
}

question_2_ru = {
    "question_text": question_2_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_2_wrong_answer_ru
}

question_3_ru = {
    "question_text": question_3_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_3_wrong_answer_ru
}

question_4_ru = {
    "question_text": question_4_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_4_wrong_answer_ru
}

question_5_ru = {
    "question_text": question_5_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'

    },
    "wrong_answer_case": question_5_wrong_answer_ru
}

question_6_ru = {
    "question_text": question_6_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_6_wrong_answer_ru
}

question_7_ru = {
    "question_text": question_7_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_7_wrong_answer_ru
}

question_8_ru = {
    "question_text": question_8_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_8_wrong_answer_ru
}

question_9_ru = {
    "question_text": question_9_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_9_wrong_answer_ru
}

question_10_ru = {
    "question_text": question_10_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '0',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_10_wrong_answer_ru
}

question_11_ru = {
    "question_text": question_11_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '1',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_11_wrong_answer_ru
}

question_12_ru = {
    "question_text": question_12_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_12_wrong_answer_ru
}

question_13_ru = {
    "question_text": question_13_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '1',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_13_wrong_answer_ru
}

question_14_ru = {
    "question_text": question_14_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '0',
        "Ответ C": '00'
    },
    "wrong_answer_case": question_14_wrong_answer_ru
}

question_15_ru = {
    "question_text": question_15_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_15_wrong_answer_ru
}

question_16_ru = {
    "question_text": question_16_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_16_wrong_answer_ru
}

question_17_ru = {
    "question_text": question_17_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_17_wrong_answer_ru
}

question_18_ru = {
    "question_text": question_18_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_18_wrong_answer_ru
}

question_19_ru = {
    "question_text": question_19_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_19_wrong_answer_ru
}

question_20_ru = {
    "question_text": question_20_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    },
    "wrong_answer_case": question_20_wrong_answer_ru
}

questions_ru = \
    {
        "question_1": question_1_ru,
        "question_2": question_2_ru,
        "question_3": question_3_ru,
        "question_4": question_4_ru,
        "question_5": question_5_ru,
        "question_6": question_6_ru,
        "question_7": question_7_ru,
        "question_8": question_8_ru,
        "question_9": question_9_ru,
        "question_10": question_10_ru,
        "question_11": question_11_ru,
        "question_12": question_12_ru,
        "question_13": question_13_ru,
        "question_14": question_14_ru,
        "question_15": question_15_ru,
        "question_16": question_16_ru,
        "question_17": question_17_ru,
        "question_18": question_18_ru,
        "question_19": question_19_ru,
        "question_20": question_20_ru,
    }

question_1_kz_text = ""
question_2_kz_text = ""
question_3_kz_text = ""
question_4_kz_text = ""
question_5_kz_text = ""
question_6_kz_text = ""
question_7_kz_text = ""
question_8_kz_text = ""
question_9_kz_text = ""
question_10_kz_text = ""
question_11_kz_text = ""
question_12_kz_text = ""
question_13_kz_text = ""
question_14_kz_text = ""
question_15_kz_text = ""
question_16_kz_text = ""
question_17_kz_text = ""
question_18_kz_text = ""
question_19_kz_text = ""
question_20_kz_text = ""

