high_result_ru = """
Оценка 11-15:
Отличное понимание - Поздравляем! Вы имеете чёткое представление о жизни ЛЖВ, развеиваете мифы и заблуждения. Ваши знания отражают уважительное и точное понимание проблем, с которыми сталкиваются ЛЖВ.
"""

high_result_kz = """

"""

medium_result_ru = """
Оценка 6-10:
Среднее понимание – Ваши знания о жизни ЛЖВ приличные, но есть возможности для улучшения. Продолжайте учиться и бороться с неправильными представлениями, чтобы способствовать более точному пониманию.
"""

medium_result_kz = """

"""

small_result_ru = """
Оценка 0-5: 
Ограниченное понимание. Судя по вашим ответам, в ваших знаниях о жизни ЛЖВ имеются некоторые неверные представления и пробелы. Рассмотрите возможность узнать больше о ВИЧ, стигме, дискриминации и правах ЛЖВ.
"""

small_result_kz = """

"""

result_ratings_kz = {
    "small": small_result_kz,
    "high": high_result_kz,
    "medium": medium_result_kz
}

result_ratings_ru = {
    "small": small_result_ru,
    "high": high_result_ru,
    "medium": medium_result_ru
}
# ТЕКСТЫ ВОПРОСОВ НА ДВУХ ЯЗЫКАХ
question_1_ru_text = """
Люди, живущие с ВИЧ (ЛЖВ), могут иметь нормальные, здоровые отношения с другими людьми

A) Правда 
B) Ложь
C) Зависит от тяжести состояния
"""

question_2_ru_text = """
К чему относится стигма ВИЧ?

A) Положительное социальное восприятие ЛЖВ

B) Дискриминация и негативное отношение к ЛЖВ 

C) Медицинский термин для прогрессирующей ВИЧ-инфекции
"""

question_3_ru_text = """
Дискриминация в отношении ЛЖВ может происходить в какой из следующих ситуаций?

A) Медицинские учреждения
B) Школы и учебные заведения
C) Работа и условия рабочего места
D) Все вышеперечисленное 
"""

question_4_ru_text = """
Что из следующего НЕ является распространенным заблуждением относительно передачи ВИЧ?

A) ВИЧ может передаваться при случайном контакте

B) Комары могут распространять ВИЧ

C) Совместное использование еды или напитков может привести к передаче ВИЧ

D) ВИЧ может передаваться воздушно-капельным путем (например, при кашле или чихании) 
"""

question_5_ru_text = """
Разрешено ли людям, живущим с ВИЧ, работать по большинству профессий?

A) Да, если они раскрывают свой ВИЧ-статус своему работодателю

B) Нет, людям, живущим с ВИЧ, запрещены некоторые профессии

C) Да, люди, живущие с ВИЧ, имеют право работать в большинстве профессий без дискриминации 
"""

question_6_ru_text = """
Могут ли ЛЖВ прожить долгую и здоровую жизнь при надлежащем медицинском уходе и лечении?

A) Да, при наличии доступа к антиретровирусной терапии и регулярному медицинскому обслуживанию ЛЖВ могут прожить долгую и здоровую жизнь 

B) Нет, ВИЧ всегда прогрессирует в СПИД и приводит к сокращению продолжительности жизни

C) Это зависит от общего состояния здоровья и образа жизни человека.
"""

question_7_ru_text = """
Какова основная цель лечения ВИЧ?

A) вылечиться от ВИЧ

B) для лечения симптомов ВИЧ-инфекции

C) для подавления вируса и поддержания общего состояния здоровья 

D) для предотвращения передачи ВИЧ другим
"""

question_8_ru_text = """
Защищены ли ЛЖВ от дискриминации в большинстве стран?

A) Да, во многих странах действуют законы, защищающие ЛЖВ от дискриминации 

B) Нет, ЛЖВ не защищены законом от дискриминации ни в одной стране

C) Это зависит от страны, некоторые из них обеспечивают правовую защиту, а другие нет
"""

question_9_ru_text = """
Что из следующего является примером основного права человека, которое необходимо соблюдать для ЛЖВ?

A) Право на охрану здоровья и лечение

B) Право на неприкосновенность частной жизни и конфиденциальность

C) Право на образование и возможности трудоустройства

D) Все вышеперечисленное 
"""

question_10_ru_text = """
Может ли ВИЧ передаваться через случайные контакты, такие как объятия или рукопожатие?

A) Да, ВИЧ может передаваться при случайном контакте

B) Нет, ВИЧ не может передаваться при случайном контакте 

C) Зависит от вирусной нагрузки человека, живущего с ВИЧ
"""

question_11_ru_text = """
Могут ли ЛЖВ иметь детей, не передавая вирус своим партнерам или детям?

A) Нет, передача неизбежна

B) Да, с помощью вспомогательных репродуктивных технологий и медицинских вмешательств

C) Только в том случае, если партнёр также является ВИЧ-позитивным
"""

question_12_ru_text = """
Являются ли ЛЖВ более восприимчивыми к распространённым заболеваниям и инфекциям?

A) Да, ЛЖВ имеют ослабленную иммунную систему и более восприимчивы к заболеваниям

B) Нет, у ЛЖВ такой же иммунный ответ, как и у людей без ВИЧ

C) Зависит от стадии ВИЧ-инфекции и общего состояния здоровья человека 
"""

question_13_ru_text = """
Какое из следующих утверждений об эффективности лечения ВИЧ верно?

A) Лечение ВИЧ может вылечить инфекцию

B) Лечение ВИЧ не может предотвратить передачу инфекции половым партнерам

C) Лечение ВИЧ может значительно снизить риск передачи инфекции 
"""

question_14_ru_text = """
Могут ли ЛЖВ вступать в сексуальные отношения без передачи вируса своим партнёрам?

A) Нет, любая сексуальная активность связана с риском передачи ВИЧ

B) Да, если ЛЖВ постоянно пользуются презервативами и имеют неопределяемую вирусную нагрузку 

C) Это зависит от сексуальной практики и мер предосторожности, принимаемых ЛЖВ
"""

question_15_ru_text = """
Обязаны ли ЛЖВ раскрывать свой ВИЧ-статус своим половым партнёрам?

A) Да, это требование законодательства в большинстве стран

B) Нет, ЛЖВ имеют право решать, когда и кому раскрывать свой ВИЧ-статус

C) Это зависит от конкретных обстоятельств и законов каждой страны 
"""


question_1_ru = {
    "question_text": question_1_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    }
}

question_2_ru = {
    "question_text": question_2_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    }
}

question_3_ru = {
    "question_text": question_3_ru_text,
    "answers": {
        "Ответ A": '000',
        "Ответ B": '00',
        "Ответ C": '0',
        "Ответ D": '1'
    }
}

question_4_ru = {
    "question_text": question_4_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '000',
        "Ответ C": '0',
        "Ответ D": '1'
    }
}

question_5_ru = {
    "question_text": question_5_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    }
}

question_6_ru = {
    "question_text": question_6_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '00',
        "Ответ C": '0'
    }
}

question_7_ru = {
    "question_text": question_7_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '00',
        "Ответ C": '1',
        "Ответ D": '000'
    }
}

question_8_ru = {
    "question_text": question_8_ru_text,
    "answers": {
        "Ответ A": '1',
        "Ответ B": '0',
        "Ответ C": '00'
    }
}

question_9_ru = {
    "question_text": question_9_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '000',
        "Ответ C": '00',
        "Ответ D": '1'
    }
}

question_10_ru = {
    "question_text": question_10_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    }
}

question_11_ru = {
    "question_text": question_11_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '1',
        "Ответ C": '00'
    }
}

question_12_ru = {
    "question_text": question_12_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '00',
        "Ответ C": '1'
    }
}

question_13_ru = {
    "question_text": question_13_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '0',
        "Ответ C": '1'
    }
}

question_14_ru = {
    "question_text": question_14_ru_text,
    "answers": {
        "Ответ A": '00',
        "Ответ B": '1',
        "Ответ C": '0'
    }
}

question_15_ru = {
    "question_text": question_15_ru_text,
    "answers": {
        "Ответ A": '0',
        "Ответ B": '00',
        "Ответ C": '1'
    }
}


questions_ru = \
    {
        "question_1": question_1_ru,
        "question_2": question_2_ru,
        "question_3": question_3_ru,
        "question_4": question_4_ru,
        "question_5": question_5_ru,
        "question_6": question_6_ru,
        "question_7": question_7_ru,
        "question_8": question_8_ru,
        "question_9": question_9_ru,
        "question_10": question_10_ru,
        "question_11": question_11_ru,
        "question_12": question_12_ru,
        "question_13": question_13_ru,
        "question_14": question_14_ru,
        "question_15": question_15_ru,
    }
